Autodesk.Revit.DB.Plumbing.PipeSegment.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ICollection{Autodesk.Revit.DB.MEPSize})
Creates a new instance of a PipeSegment and adds it to the document.
ADocument:
The document where the PipeSegment will be created and added.
MaterialId:
The ElementId of the MaterialElem of the pipe segment.
ScheduleId:
The ElementId of the PipeScheduleType of the pipe segment.
sizeSet:
A set of one or more sizes.
Returns:
The newly created pipe segment element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The size list is empty.
-or-
The MaterialId and ScheduleId was already used by another pipe segment. Please use a new Material, a new Schedule/Type, or both.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013